---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentPrintingEventArgs
source: html/145a064e-d357-cc52-573d-2cdcf2edbc30.htm
---
# DocumentPrintingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.